#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_lambda_permission.eventbridge_publish_invoke["publish-status"] will be created
  + resource "aws_lambda_permission" "eventbridge_publish_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "myrunstreak-publish-status-dev"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowEventBridgePublishInvoke-publish-status"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_execution_arn will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_execution_arn" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-execution-arn"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-id"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_invoke_url will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_invoke_url" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-invoke-url"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_root_resource_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_root_resource_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-root-resource-id"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.data.aws_ssm_parameter.api_gateway_stage_name will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "api_gateway_stage_name" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/runstreak/shared/dev/api-gateway-stage-name"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.api_gateway_consumer.aws_api_gateway_deployment.myrunstreak must be replaced
+/- resource "aws_api_gateway_deployment" "myrunstreak" {
      ~ created_date  = "2025-12-05T02:05:37Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-2:855323747881:inc6slepzb/" -> (known after apply)
      ~ id            = "7x9zih" -> (known after apply)
      ~ invoke_url    = "https://inc6slepzb.execute-api.us-east-2.amazonaws.com/" -> (known after apply)
      ~ rest_api_id   = (sensitive value) # forces replacement
      ~ triggers      = {
          - "redeployment" = "ec0af04d5ff7d1b0513c9e3d7a32722d4163c3be"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.auth_callback must be replaced
+/- resource "aws_api_gateway_integration" "auth_callback" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "qkr94j" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-qkr94j-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "qkr94j" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.auth_login_url must be replaced
+/- resource "aws_api_gateway_integration" "auth_login_url" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "vt11og" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-vt11og-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "vt11og" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.auth_store_tokens must be replaced
+/- resource "aws_api_gateway_integration" "auth_store_tokens" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "0fhp26" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-0fhp26-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "0fhp26" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.runs_get must be replaced
+/- resource "aws_api_gateway_integration" "runs_get" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "pndedr" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-pndedr-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "pndedr" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.runs_proxy must be replaced
+/- resource "aws_api_gateway_integration" "runs_proxy" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "u3rde2" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-u3rde2-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "u3rde2" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.stats_proxy must be replaced
+/- resource "aws_api_gateway_integration" "stats_proxy" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "fda5wn" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-fda5wn-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "fda5wn" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.sync_lambda must be replaced
+/- resource "aws_api_gateway_integration" "sync_lambda" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "ik5tpx" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-ik5tpx-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "ik5tpx" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.sync_options must be replaced
+/- resource "aws_api_gateway_integration" "sync_options" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "ik5tpx" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-ik5tpx-OPTIONS" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      ~ resource_id             = "ik5tpx" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration.sync_user must be replaced
+/- resource "aws_api_gateway_integration" "sync_user" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "1iu0hl" -> (known after apply)
      ~ id                      = "agi-inc6slepzb-1iu0hl-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "1iu0hl" -> (known after apply) # forces replacement
      ~ rest_api_id             = (sensitive value) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration_response.sync_lambda must be replaced
-/+ resource "aws_api_gateway_integration_response" "sync_lambda" {
      ~ id                  = "agir-inc6slepzb-ik5tpx-POST-200" -> (known after apply)
      ~ resource_id         = "ik5tpx" -> (known after apply) # forces replacement
      - response_parameters = {} -> null
      - response_templates  = {} -> null
      ~ rest_api_id         = (sensitive value) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_integration_response.sync_options must be replaced
-/+ resource "aws_api_gateway_integration_response" "sync_options" {
      ~ id                  = "agir-inc6slepzb-ik5tpx-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "ik5tpx" -> (known after apply) # forces replacement
      - response_templates  = {} -> null
      ~ rest_api_id         = (sensitive value) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.auth_callback_post must be replaced
+/- resource "aws_api_gateway_method" "auth_callback_post" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-qkr94j-POST" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "qkr94j" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.auth_login_url_get must be replaced
+/- resource "aws_api_gateway_method" "auth_login_url_get" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-vt11og-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "vt11og" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.auth_store_tokens_post must be replaced
+/- resource "aws_api_gateway_method" "auth_store_tokens_post" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-0fhp26-POST" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "0fhp26" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.runs_get must be replaced
+/- resource "aws_api_gateway_method" "runs_get" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-pndedr-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "pndedr" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.runs_proxy_get must be replaced
+/- resource "aws_api_gateway_method" "runs_proxy_get" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-u3rde2-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "u3rde2" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.stats_proxy_get must be replaced
+/- resource "aws_api_gateway_method" "stats_proxy_get" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-fda5wn-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "fda5wn" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.sync_options must be replaced
+/- resource "aws_api_gateway_method" "sync_options" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-ik5tpx-OPTIONS" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "ik5tpx" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.sync_post must be replaced
+/- resource "aws_api_gateway_method" "sync_post" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-ik5tpx-POST" -> (known after apply)
      - request_models       = {} -> null
      ~ resource_id          = "ik5tpx" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method.sync_user_post must be replaced
+/- resource "aws_api_gateway_method" "sync_user_post" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-inc6slepzb-1iu0hl-POST" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "1iu0hl" -> (known after apply) # forces replacement
      ~ rest_api_id          = (sensitive value) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method_response.sync_options_200 must be replaced
-/+ resource "aws_api_gateway_method_response" "sync_options_200" {
      ~ id                  = "agmr-inc6slepzb-ik5tpx-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "ik5tpx" -> (known after apply) # forces replacement
      ~ rest_api_id         = (sensitive value) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_method_response.sync_post_200 must be replaced
-/+ resource "aws_api_gateway_method_response" "sync_post_200" {
      ~ id                  = "agmr-inc6slepzb-ik5tpx-POST-200" -> (known after apply)
      ~ resource_id         = "ik5tpx" -> (known after apply) # forces replacement
      ~ rest_api_id         = (sensitive value) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth must be replaced
+/- resource "aws_api_gateway_resource" "auth" {
      ~ id          = "6o6owu" -> (known after apply)
      ~ parent_id   = (sensitive value)
      ~ path        = "/auth" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth_callback must be replaced
+/- resource "aws_api_gateway_resource" "auth_callback" {
      ~ id          = "qkr94j" -> (known after apply)
      ~ parent_id   = "6o6owu" -> (known after apply)
      ~ path        = "/auth/callback" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth_login_url must be replaced
+/- resource "aws_api_gateway_resource" "auth_login_url" {
      ~ id          = "vt11og" -> (known after apply)
      ~ parent_id   = "6o6owu" -> (known after apply)
      ~ path        = "/auth/login-url" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.auth_store_tokens must be replaced
+/- resource "aws_api_gateway_resource" "auth_store_tokens" {
      ~ id          = "0fhp26" -> (known after apply)
      ~ parent_id   = "6o6owu" -> (known after apply)
      ~ path        = "/auth/store-tokens" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.runs must be replaced
+/- resource "aws_api_gateway_resource" "runs" {
      ~ id          = "pndedr" -> (known after apply)
      ~ parent_id   = (sensitive value)
      ~ path        = "/runs" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.runs_proxy must be replaced
+/- resource "aws_api_gateway_resource" "runs_proxy" {
      ~ id          = "u3rde2" -> (known after apply)
      ~ parent_id   = "pndedr" -> (known after apply)
      ~ path        = "/runs/{proxy+}" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.stats must be replaced
+/- resource "aws_api_gateway_resource" "stats" {
      ~ id          = "g6x6no" -> (known after apply)
      ~ parent_id   = (sensitive value)
      ~ path        = "/stats" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.stats_proxy must be replaced
+/- resource "aws_api_gateway_resource" "stats_proxy" {
      ~ id          = "fda5wn" -> (known after apply)
      ~ parent_id   = "g6x6no" -> (known after apply)
      ~ path        = "/stats/{proxy+}" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.sync must be replaced
+/- resource "aws_api_gateway_resource" "sync" {
      ~ id          = "ik5tpx" -> (known after apply)
      ~ parent_id   = (sensitive value)
      ~ path        = "/sync" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_api_gateway_resource.sync_user must be replaced
+/- resource "aws_api_gateway_resource" "sync_user" {
      ~ id          = "1iu0hl" -> (known after apply)
      ~ parent_id   = (sensitive value)
      ~ path        = "/sync-user" -> (known after apply)
      ~ rest_api_id = (sensitive value) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api_gateway_consumer.aws_lambda_permission.query_lambda_api_gateway must be replaced
-/+ resource "aws_lambda_permission" "query_lambda_api_gateway" {
      ~ id                  = "AllowAPIGatewayInvoke-dev" -> (known after apply)
      ~ source_arn          = (sensitive value) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.aws_lambda_permission.sync_lambda_api_gateway must be replaced
-/+ resource "aws_lambda_permission" "sync_lambda_api_gateway" {
      ~ id                  = "AllowAPIGatewayInvoke-dev" -> (known after apply)
      ~ source_arn          = (sensitive value) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.api_gateway_consumer.null_resource.update_stage_deployment must be replaced
-/+ resource "null_resource" "update_stage_deployment" {
      ~ id       = "5558375449841883945" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployment_id" = "7x9zih" -> (known after apply)
        }
    }

  # module.eventbridge_publish.aws_cloudwatch_event_rule.sync["publish-status"] will be created
  + resource "aws_cloudwatch_event_rule" "sync" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda to sync running data from SmashRun at Refresh status widget every 3 hours"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "myrunstreak-sync-publish-status-dev"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(3 hours)"
      + state               = "ENABLED"
      + tags                = {
          + "Environment" = "dev"
          + "Name"        = "myrunstreak-sync-publish-status"
          + "Project"     = "MyRunStreak"
        }
      + tags_all            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myrunstreak-sync-publish-status"
          + "Project"     = "MyRunStreak"
        }
    }

  # module.eventbridge_publish.aws_cloudwatch_event_target.lambda["publish-status"] will be created
  + resource "aws_cloudwatch_event_target" "lambda" {
      + arn            = "arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-publish-status-dev"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + action   = "scheduled_publish"
              + schedule = "publish-status"
              + source   = "eventbridge"
            }
        )
      + rule           = "myrunstreak-sync-publish-status-dev"
      + target_id      = "lambda-sync-runner"

      + retry_policy {
          + maximum_event_age_in_seconds = 1800
          + maximum_retry_attempts       = 2
        }
    }

  # module.eventbridge_publish.aws_cloudwatch_metric_alarm.invocation_failures["publish-status"] will be created
  + resource "aws_cloudwatch_metric_alarm" "invocation_failures" {
      + actions_enabled                       = true
      + alarm_description                     = "EventBridge failed to invoke Lambda for publish-status schedule"
      + alarm_name                            = "myrunstreak-eventbridge-failures-publish-status-dev"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "RuleName" = "myrunstreak-sync-publish-status-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FailedInvocations"
      + namespace                             = "AWS/Events"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "MyRunStreak"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.github_oidc.aws_iam_openid_connect_provider.github will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::855323747881:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
            "Environment" = "dev"
            "Name"        = "github-actions-oidc"
          ~ "Project"     = "freeradius-lab" -> "MyRunStreak"
        }
      ~ tags_all        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          ~ "Project"     = "freeradius-lab" -> "MyRunStreak"
            # (1 unchanged element hidden)
        }
      ~ thumbprint_list = [
          ~ "6938fd4d98bab03faadb97b34396831e3780aea1" -> "ffffffffffffffffffffffffffffffffffffffff",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.sync_runner will be updated in-place
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-sync-runner-dev"
      ~ image_uri                      = "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-sync-dev:ef535cd5bc16cec67289cb55a8a3bbfa3ffbcf64" -> "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-sync-dev:latest"
      ~ last_modified                  = "2026-02-19T23:04:34.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-sync-runner-dev"
            "Project"     = "MyRunStreak"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "PUBLISH_STATUS_FUNCTION_NAME" = "myrunstreak-publish-status-dev"
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_publish_status.aws_lambda_function.sync_runner will be updated in-place
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-publish-status-dev"
      ~ image_uri                      = "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-publish-status-dev:ef535cd5bc16cec67289cb55a8a3bbfa3ffbcf64" -> "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-publish-status-dev:latest"
      ~ last_modified                  = "2026-02-19T23:04:19.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-publish-status-dev"
            "Project"     = "MyRunStreak"
        }
        # (26 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lambda_query.aws_lambda_function.sync_runner will be updated in-place
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-query-runner-dev"
      ~ image_uri                      = "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-query-dev:ef535cd5bc16cec67289cb55a8a3bbfa3ffbcf64" -> "855323747881.dkr.ecr.us-east-2.amazonaws.com/myrunstreak-query-dev:latest"
      ~ last_modified                  = "2026-02-19T23:04:22.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-query-runner-dev"
            "Project"     = "MyRunStreak"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "PUBLISH_STATUS_FUNCTION_NAME" = "myrunstreak-publish-status-dev" -> null
                # (5 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 40 to add, 4 to change, 36 to destroy.

Changes to Outputs:
  ~ api_gateway_url                   = (sensitive value)
  ~ api_health_endpoint               = (sensitive value)
  ~ api_runs_endpoint                 = (sensitive value)
  ~ api_stats_endpoint                = (sensitive value)
  ~ api_sync_endpoint                 = (sensitive value)
  ~ deployment_instructions           = (sensitive value)

```

</details>

*Pusher: @silverbeer, Action: `pull_request`, Working Directory: `terraform/environments/dev`, Workflow: `Terraform Plan`*